wq1998github/STM32F407VGT6/03_ucosii/BSP/Source/bsp_uart.c
#include "bsp_uart.h"
#include <stdio.h>

#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_usart.h"

void uart1_init(uint32_t baudrate)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

	GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1); // IO口用作串口引脚要配置复用模式
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);

	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;	 // TX引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF; // IO口用作串口引脚要配置复用模式
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10; // RX引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	USART_InitTypeDef USART_InitStructure; // 定义配置串口的结构体变量

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); // 开启串口1的时钟

	USART_DeInit(USART1); // 大概意思是解除此串口的其他配置

	USART_StructInit(&USART_InitStructure);
	USART_InitStructure.USART_BaudRate = baudrate;									// 设置波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						// 字节长度为8bit
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							// 1个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;								// 没有校验位
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					// 将串口配置为收发模式
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // 不提供流控
	USART_Init(USART1, &USART_InitStructure);										// 将相关参数初始化给串口1

	USART_ClearFlag(USART1, USART_FLAG_RXNE); // 初始配置时清除接受置位

	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE); // 初始配置接受中断

	USART_Cmd(USART1, ENABLE); // 开启串口1

	NVIC_InitTypeDef NVIC_InitStructure; // 中断控制结构体变量定义

	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;		  // 中断通道指定为USART1
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; // 主优先级为0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;		  // 次优先级为1
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			  // 确定使能
	NVIC_Init(&NVIC_InitStructure);							  // 初始化配置此中断通道
}

#if !defined(__MICROLIB)
// 不使用微库的话就需要添加下面的函数
#if (__ARMCLIB_VERSION <= 6000000)
// 如果编译器是AC5  就定义下面这个结构体
struct __FILE
{
	int handle;
};
#endif

FILE __stdout;

// 定义_sys_exit()以避免使用半主机模式
void _sys_exit(int x)
{
	x = x;
}
#endif

/* retarget the C library printf function to the USART */
int fputc(int ch, FILE *f)
{
	USART_SendData(USART1, (uint8_t)ch);

	while (RESET == USART_GetFlagStatus(USART1, USART_FLAG_TXE))
	{
	}

	return ch;
}

/******** 串口1 中断服务函数 ***********/
void USART1_IRQHandler(void)
{
	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET) // 判断是不是真的有中断发生
	{
		// USART_SendData(USART1,USART_ReceiveData(USART1));//又将数据发回去(用于验证)

		USART_ClearITPendingBit(USART1, USART_IT_RXNE); // 已经处理就清楚标志位
	}
}
